In [40]:
#Practical 1 : Create a Data Frame and perform Matrix-like Operations on Data Frame(Creating a random data frame)

In [1]:
import pandas as pd
import numpy as np

In [16]:
data = np.random.randn(5,5)

In [17]:
df = pd.DataFrame(data)

In [18]:
df

          0         1         2         3         4
0 -0.052425  0.404987 -0.210183 -1.114964  0.102501
1  0.867855  1.011995 -0.521919  0.946192 -0.177486
2  0.056298  0.110110  1.160098 -0.442963  0.054939
3 -0.910430  0.596232 -1.041146  0.060114 -1.252006
4 -1.109831 -0.504834 -0.546843 -0.298232  0.492195

In [33]:
s = pd.Series([1,2,3,4,5])

In [35]:
df.dot(s)

0   -3.820350
1    4.223423
2    2.259654
3   -8.860981
4   -2.491978
dtype: float64

In [36]:
df.add(s)

          0         1         2         3         4
0  0.947575  2.404987  2.789817  2.885036  5.102501
1  1.867855  3.011995  2.478081  4.946192  4.822514
2  1.056298  2.110110  4.160098  3.557037  5.054939
3  0.089570  2.596232  1.958854  4.060114  3.747994
4 -0.109831  1.495166  2.453157  3.701768  5.492195

In [37]:
df.sub(s)

          0         1         2         3         4
0 -1.052425 -1.595013 -3.210183 -5.114964 -4.897499
1 -0.132145 -0.988005 -3.521919 -3.053808 -5.177486
2 -0.943702 -1.889890 -1.839902 -4.442963 -4.945061
3 -1.910430 -1.403768 -4.041146 -3.939886 -6.252006
4 -2.109831 -2.504834 -3.546843 -4.298232 -4.507805

In [38]:
df.mul(s)

          0         1         2         3         4
0 -0.052425  0.809973 -0.630549 -4.459854  0.512504
1  0.867855  2.023990 -1.565758  3.784770 -0.887432
2  0.056298  0.220220  3.480294 -1.771852  0.274695
3 -0.910430  1.192464 -3.123438  0.240455 -6.260032
4 -1.109831 -1.009668 -1.640528 -1.192927  2.460976

In [39]:
df.div(s)

          0         1         2         3         4
0 -0.052425  0.202493 -0.070061 -0.278741  0.020500
1  0.867855  0.505997 -0.173973  0.236548 -0.035497
2  0.056298  0.055055  0.386699 -0.110741  0.010988
3 -0.910430  0.298116 -0.347049  0.015028 -0.250401
4 -1.109831 -0.252417 -0.182281 -0.074558  0.098439

In [ ]:
#Practical 2

In [19]:
df.sum()

0   -1.148533
1    1.618490
2   -1.159993
3   -0.849852
4   -0.779858
dtype: float64

In [20]:
df.mean()

0   -0.229707
1    0.323698
2   -0.231999
3   -0.169970
4   -0.155972
dtype: float64

In [23]:
df.std()

0    0.799355
1    0.567168
2    0.833113
3    0.755438
4    0.658249
dtype: float64

In [25]:
df.var()

0    0.638968
1    0.321680
2    0.694077
3    0.570687
4    0.433292
dtype: float64

In [26]:
df.min()

0   -1.109831
1   -0.504834
2   -1.041146
3   -1.114964
4   -1.252006
dtype: float64

In [27]:
df.max()

0    0.867855
1    1.011995
2    1.160098
3    0.946192
4    0.492195
dtype: float64

In [29]:
df.cumsum()

          0         1         2         3         4
0 -0.052425  0.404987 -0.210183 -1.114964  0.102501
1  0.815430  1.416982 -0.732102 -0.168771 -0.074986
2  0.871728  1.527092  0.427996 -0.611734 -0.020047
3 -0.038702  2.123324 -0.613150 -0.551620 -1.272053
4 -1.148533  1.618490 -1.159993 -0.849852 -0.779858

In [30]:
df.cumprod()

          0         1         2         3         4
0 -0.052425  0.404987 -0.210183 -1.114964  0.102501
1 -0.045497  0.409845  0.109699 -1.054970 -0.018193
2 -0.002561  0.045128  0.127261  0.467313 -0.000999
3  0.002332  0.026907 -0.132497  0.028092  0.001251
4 -0.002588 -0.013583  0.072455 -0.008378  0.000616

In [5]:
#Practical 3 (Creating a data frame from given data of employee)

In [13]:
data_of_Employee = {'EMP ID':[1,2,3,4,5], 'EMP NAME':['Satish','Reeya','jay','Roy','Serah'], 'SALARY': [50000,75000,100000,45000,55000], 'START DATE':['01-11-2017','12-05-2016','22-09-2015','08-01-2017','06-02-2018']}

In [21]:
df1 = pd.DataFrame(data_of_Employee)

In [22]:
df1

   EMP ID EMP NAME  SALARY  START DATE
0       1   Satish   50000  01-11-2017
1       2    Reeya   75000  12-05-2016
2       3      jay  100000  22-09-2015
3       4      Roy   45000  08-01-2017
4       5    Serah   55000  06-02-2018